from Scripts.text_generation import TextGenertion
from Scripts.text_to_speech import TextToSpeech


def main():
    # TextGenertion()
    TextToSpeech(text=' Сәлеметсіз бе! Мен сіздің дауыстық көмекшіңізмін, сізге көмектесуге әрқашан дайынмын. Мен көмектесу үшін не істей аламын? Маған кез келген сұрақ қойыңыз немесе нақты тапсырманы орындауды сұраңыз, мен ең дәл және пайдалы жауап беруге тырысамын. Мен кең ойлымын және ақпаратты табу мен математикалық есептерді шешуден бастап кеңес пен шабыт беруге дейін әртүрлі жолдармен көмектесе аламын. Сұрақтар қоюдан тартынбаңыз, біз бірге жауаптар мен шешімдерді табамыз!')
    

if __name__ == '__main__':
    main()
